In [38]:
import pandas as pd
import numpy as np
import dateutil
import datetime
import numpy as np
import pandas as pd
import plotly.graph_objects as go
import numpy as np
import pandas as pd
import altair as alt
from vega_datasets import data
from plotly.subplots import make_subplots
import plotly.express as px
import json

#only in jupyter notebook need plotly offline mode
#I still got some error when using Jupyterlab
from plotly.offline import download_plotlyjs, init_notebook_mode, iplot
init_notebook_mode(connected=True)

In [39]:
#loading data
total_confirmed=pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv',encoding='utf-8',na_values=None)
# #Replace US with United States
total_confirmed.replace(to_replace='US', value='United States', regex=True, inplace=True)

total_death=pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv',encoding='utf-8',na_values=None)
total_death.replace(to_replace='US', value='United States', regex=True, inplace=True)

total_recovered=pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_recovered_global.csv',encoding='utf-8',na_values=None)
total_recovered.replace(to_replace='US', value='United States', regex=True, inplace=True)

In [40]:
total_recovered[total_recovered["Country/Region"] == "United States"]

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,2/28/23,3/1/23,3/2/23,3/3/23,3/4/23,3/5/23,3/6/23,3/7/23,3/8/23,3/9/23
245,NaN,United States,40.0,-100.0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

## 1. Get country-grouped  and global time series data frame

#### grouped total confiremed data

In [41]:
grouped_total_confirmed = total_confirmed[["Country/Region", total_confirmed.columns[-1]]].groupby("Country/Region").sum().sort_values(by=total_confirmed.columns[-1], ascending=True)
grouped_total_confirmed.reset_index(inplace=True)
grouped_total_confirmed.columns = ["Country/Region", "confirmed"]
grouped_total_confirmed.replace(to_replace='US', value='United States', regex=True
                                , inplace=True)

In [42]:
grouped_total_confirmed

           Country/Region  confirmed
0            Korea, North          1
1              MS Zaandam          9
2              Antarctica         11
3                Holy See         29
4    Winter Olympics 2022        535
..                    ...        ...
196                Brazil   37076053
197               Germany   38249060
198                France   39866718
199                 India   44690738
200         United States  103802702

[201 rows x 2 columns]

In [43]:
# Chart.js can't plot dataframe object, so we need to change some to list
barplot_confirmed_values = grouped_total_confirmed["confirmed"].values.tolist()
country_names = grouped_total_confirmed["Country/Region"].values.tolist()
country_names

['Korea, North',
 'MS Zaandam',
 'Antarctica',
 'Holy See',
 'Winter Olympics 2022',
 'Diamond Princess',
 'Summer Olympics 2020',
 'Tuvalu',
 'Kiribati',
 'Nauru',
 'Palau',
 'Sao Tome and Principe',
 'Saint Kitts and Nevis',
 'Chad',
 'Sierra Leone',
 'Liberia',
 'Guinea-Bissau',
 'Comoros',
 'Antigua and Barbuda',
 'Niger',
 'Saint Vincent and the Grenadines',
 'Eritrea',
 'Yemen',
 'Vanuatu',
 'Gambia',
 'Central African Republic',
 'Marshall Islands',
 'Nicaragua',
 'Djibouti',
 'Dominica',
 'Monaco',
 'Samoa',
 'Tonga',
 'Equatorial Guinea',
 'Tajikistan',
 'South Sudan',
 'Grenada',
 'Liechtenstein',
 'Burkina Faso',
 'Timor-Leste',
 'San Marino',
 'Micronesia',
 'Solomon Islands',
 'Congo (Brazzaville)',
 'Somalia',
 'Benin',
 'Saint Lucia',
 'Mali',
 'Haiti',
 'Lesotho',
 'Bahamas',
 'Guinea',
 'Togo',
 'Tanzania',
 'Papua New Guinea',
 'Andorra',
 'Gabon',
 'Seychelles',
 'Burundi',
 'Syria',
 'Bhutan',
 'Cabo Verde',
 'Mauritania',
 'Sudan',
 'Madagascar',
 'Fiji',
 'Belize',
 'Guyana',
 'Eswatini',
 'Suriname',
 "Cote d'Ivoire",
 'Malawi',
 'Senegal',
 'Congo (Kinshasa)',
 'Angola',
 'Barbados',
 'Malta',
 'Cameroon',
 'Rwanda',
 'Cambodia',
 'Jamaica',
 'Uganda',
 'Namibia',
 'Ghana',
 'Maldives',
 'Trinidad and Tobago',
 'El Salvador',
 'Kyrgyzstan',
 'Iceland',
 'Afghanistan',
 'Laos',
 'Mozambique',
 'Uzbekistan',
 'Zimbabwe',
 'Nigeria',
 'Algeria',
 'Kosovo',
 'Brunei',
 'Montenegro',
 'Mauritius',
 'Luxembourg',
 'Botswana',
 'Albania',
 'Kenya',
 'Zambia',
 'North Macedonia',
 'Oman',
 'Bosnia and Herzegovina',
 'Armenia',
 'Honduras',
 'Qatar',
 'Ethiopia',
 'Libya',
 'Egypt',
 'Venezuela',
 'Moldova',
 'Estonia',
 'Burma',
 'Cyprus',
 'Dominican Republic',
 'Kuwait',
 'Sri Lanka',
 'West Bank and Gaza',
 'Bahrain',
 'Paraguay',
 'Azerbaijan',
 'Saudi Arabia',
 'Latvia',
 'Belarus',
 'Nepal',
 'Mongolia',
 'Panama',
 'Uruguay',
 'United Arab Emirates',
 'Ecuador',
 'Cuba',
 'Tunisia',
 'Bolivia',
 'Costa Rica',
 'Lebanon',
 'Guatemala',
 'Croatia',
 'Morocco',
 'Bulgaria',
 'Lithuania',
 'Slovenia',
 'Finland',
 'Norway',
 'Kazakhstan',
 'Pakistan',
 'Ireland',
 'Jordan',
 'Georgia',
 'Bangladesh',
 'Hungary',
 'Singapore',
 'New Zealand',
 'Iraq',
 'Serbia',
 'Slovakia',
 'Sweden',
 'Romania',
 'Denmark',
 'South Africa',
 'Philippines',
 'Switzerland',
 'Peru',
 'Canada',
 'Czechia',
 'Thailand',
 'Belgium',
 'Israel',
 'China',
 'Malaysia',
 'Chile',
 'Greece',
 'Portugal',
 'Ukraine',
 'Austria',
 'Colombia',
 'Poland',
 'Indonesia',
 'Mexico',
 'Iran',
 'Netherlands',
 'Taiwan*',
 'Argentina',
 'Australia',
 'Vietnam',
 'Spain',
 'Turkey',
 'Russia',
 'United Kingdom',
 'Italy',
 'Korea, South',
 'Japan',
 'Brazil',
 'Germany',
 'France',
 'India',
 'United States']

In [44]:
# global time series confiremed data frame
global_confirmed_timeseries = pd.DataFrame(total_confirmed[total_confirmed.columns[4:]].sum())
global_confirmed_timeseries.reset_index(inplace=True)
global_confirmed_timeseries.columns = ['date', 'total confirmed']

#global daily new cases = global daily confirmed at date (t) -  global daily confirmed at date (t-1)
global_confirmed_timeseries["daily new cases"] = global_confirmed_timeseries["total confirmed"] - global_confirmed_timeseries['total confirmed'].shift()
global_confirmed_timeseries = global_confirmed_timeseries.fillna(0)
global_confirmed_timeseries

         date  total confirmed  daily new cases
0     1/22/20              557              0.0
1     1/23/20              657            100.0
2     1/24/20              944            287.0
3     1/25/20             1437            493.0
4     1/26/20             2120            683.0
...       ...              ...              ...
1138   3/5/23        676024901          56126.0
1139   3/6/23        676082941          58040.0
1140   3/7/23        676213378         130437.0
1141   3/8/23        676392824         179446.0
1142   3/9/23        676570149         177325.0

[1143 rows x 3 columns]

#### grouped total recovered data

In [45]:
grouped_total_recovered = total_recovered[["Country/Region", total_recovered.columns[-1]]].groupby("Country/Region").sum().sort_values(by=total_recovered.columns[-1], ascending=False)
grouped_total_recovered.reset_index(inplace=True)
grouped_total_recovered.columns = ["Country/Region", "recovered"]
grouped_total_recovered.replace(to_replace="US", value="United States", regex=True, inplace=True)

In [46]:
# chart.js can't plot dataframe object, so we need to change some to list
barplot_recovered_values = grouped_total_recovered["recovered"].values.tolist()
country_names = grouped_total_recovered["Country/Region"].values.tolist()

In [47]:
# global time series recovered data frame
global_recovered_timeseries = pd.DataFrame(total_recovered[total_recovered.columns[4:]].sum())
global_recovered_timeseries.reset_index(inplace=True)
global_recovered_timeseries.columns = ["date", "total recovered"]

global_recovered_timeseries

         date  total recovered
0     1/22/20               30
1     1/23/20               32
2     1/24/20               39
3     1/25/20               42
4     1/26/20               56
...       ...              ...
1138   3/5/23                0
1139   3/6/23                0
1140   3/7/23                0
1141   3/8/23                0
1142   3/9/23                0

[1143 rows x 2 columns]

In [48]:
global_recovered_timeseries["daily new recovered"] = global_recovered_timeseries['total recovered'] - global_recovered_timeseries['total recovered'].shift()
global_recovered_timeseries=global_recovered_timeseries.fillna(0)
global_recovered_timeseries

         date  total recovered  daily new recovered
0     1/22/20               30                  0.0
1     1/23/20               32                  2.0
2     1/24/20               39                  7.0
3     1/25/20               42                  3.0
4     1/26/20               56                 14.0
...       ...              ...                  ...
1138   3/5/23                0                  0.0
1139   3/6/23                0                  0.0
1140   3/7/23                0                  0.0
1141   3/8/23                0                  0.0
1142   3/9/23                0                  0.0

[1143 rows x 3 columns]

#### grouping the data by each country to get total confirmed cases

In [49]:
grouped_total_death = pd.DataFrame(total_death[total_death.columns[4:]].sum())
grouped_total_death.reset_index(inplace=True)
grouped_total_death.columns = ["Country/Region", "deaths"]
grouped_total_death.replace(to_replace="US", value="United States", regex=True, inplace=True)

grouped_total_death

     Country/Region   deaths
0           1/22/20       17
1           1/23/20       18
2           1/24/20       26
3           1/25/20       42
4           1/26/20       56
...             ...      ...
1138         3/5/23  6877749
1139         3/6/23  6878115
1140         3/7/23  6879038
1141         3/8/23  6880483
1142         3/9/23  6881802

[1143 rows x 2 columns]

In [50]:
#Chart.js can't plot dataframe object, so we need to change some to list
barplot_death_values = grouped_total_death["deaths"].values.tolist()
global_death_timeseries = total_death[total_death.columns[4:]].sum()

global_death_timeseries

1/22/20         17
1/23/20         18
1/24/20         26
1/25/20         42
1/26/20         56
            ...
3/5/23     6877749
3/6/23     6878115
3/7/23     6879038
3/8/23     6880483
3/9/23     6881802
Length: 1143, dtype: int64

In [51]:
# global time series death data frame
global_death_timeseries = pd.DataFrame(total_death[total_death.columns[4:]].sum())
global_death_timeseries.reset_index(inplace=True)
global_death_timeseries.columns = ["date", "total deaths"]

global_death_timeseries

         date  total deaths
0     1/22/20            17
1     1/23/20            18
2     1/24/20            26
3     1/25/20            42
4     1/26/20            56
...       ...           ...
1138   3/5/23       6877749
1139   3/6/23       6878115
1140   3/7/23       6879038
1141   3/8/23       6880483
1142   3/9/23       6881802

[1143 rows x 2 columns]

In [52]:
# global daily deaths = global daily deaths at date(t) - global daily deaths at date(t-1)
global_death_timeseries["daily new deaths"] = global_death_timeseries["total deaths"] - global_death_timeseries["total deaths"].shift()
global_death_timeseries = global_death_timeseries.fillna(0)
global_death_timeseries

         date  total deaths  daily new deaths
0     1/22/20            17               0.0
1     1/23/20            18               1.0
2     1/24/20            26               8.0
3     1/25/20            42              16.0
4     1/26/20            56              14.0
...       ...           ...               ...
1138   3/5/23       6877749             148.0
1139   3/6/23       6878115             366.0
1140   3/7/23       6879038             923.0
1141   3/8/23       6880483            1445.0
1142   3/9/23       6881802            1319.0

[1143 rows x 3 columns]

#### merge all the data to get full time series dataframe

In [53]:
timeseries_final = pd.merge(
    global_confirmed_timeseries,
    global_recovered_timeseries,
    how='inner',
    on='date'
)

timeseries_final = pd.merge(
    timeseries_final,
    global_death_timeseries,
    how='inner',
    on='date'
)

timeseries_final

,date,total confirmed,daily new cases,total recovered,daily new recovered,total deaths,daily new deaths
0,1/22/20,557,0.0,30,0.0,17,0.0
1,1/23/20,657,100.0,32,2.0,18,1.0
2,1/24/20,944,287.0,39,7.0,26,8.0
3,1/25/20,1437,493.0,42,3.0,42,16.0
4,1/26/20,2120,683.0,56,14.0,56,14.0
...,...,...,...,...,...,...,...
1138,3/5/23,676024901,56126.0,0,0.0,6877749,148.0
1139,3/6/23,676082941,58040.0,0,0.0,6878115,366.0
1140,3/7/23,676213378,130437.0,0,0.0,6879038,923.0
1141,3/8/23,676392824,179446.0,0,0.0,6880483,1445.0
1142,3/9/23,676570149,177325.0,0,0.0,6881802,1319.0

In [54]:
# total confiremed cases globally
total_confirmed[total_confirmed.columns[-1]].sum()

676570149

In [55]:
# total recovered cases globally
total_recovered[total_recovered.columns[-1]].sum()

0

In [56]:
total_death[total_death.columns[-1]].sum()

6881802

In [57]:
# Data that contain population for each country to calculate confirmed cases/population
df_pop = pd.read_json('https://raw.githubusercontent.com/samayo/country-json/master/src/country-by-population.json')
df_pop

               country  population
0          Afghanistan    37172386
1              Albania     2866376
2              Algeria    42228429
3       American Samoa       55465
4              Andorra       77006
..                 ...         ...
240  Wallis and Futuna       15289
241     Western Sahara      652271
242              Yemen    28498687
243             Zambia    17351822
244           Zimbabwe    14439018

[245 rows x 2 columns]

In [58]:
# some country name has differnt format, so I need to change it to match my first dataset
df_pop.columns = ["Country/Region", "population"]
df_pop = df_pop.replace(to_replace="Russian Federation", value="Russia")
df_pop

        Country/Region  population
0          Afghanistan    37172386
1              Albania     2866376
2              Algeria    42228429
3       American Samoa       55465
4              Andorra       77006
..                 ...         ...
240  Wallis and Futuna       15289
241     Western Sahara      652271
242              Yemen    28498687
243             Zambia    17351822
244           Zimbabwe    14439018

[245 rows x 2 columns]

### country code for geographical analysis

In [59]:
# country code for geographical analysis, Altair need numberical code and Plotly need alfabetical code
# country code and id for later geographical analysis
url =  "https://gist.githubusercontent.com/komasaru/9303029/raw/9ea6e5900715afec6ce4ff79a0c4102b09180ddd/iso_3166_1.csv"

country_code = pd.read_csv(url)
country_code = country_code[["English short name", "Alpha-3 code", "Numeric"]]
country_code.columns = ["Country/Region", "code3", "id"]

# change the data for later merging
# if not match the value will be deleted, so we need to make sure each country name from each table has same value
country_code = country_code.replace(
    to_replace="Russian Federation (the)",
    value="United Kingdom"
)

country_code = country_code.replace(
    to_replace="United States (the)",
    value="United States"
)

country_code = country_code.replace(
    to_replace="Viet Nam",
    value="Vietnam"
)

country_code

        Country/Region code3   id
0          Afghanistan   AFG    4
1        Åland Islands   ALA  248
2              Albania   ALB    8
3              Algeria   DZA   12
4       American Samoa   ASM   16
..                 ...   ...  ...
244  Wallis and Futuna   WLF  876
245    Western Sahara*   ESH  732
246              Yemen   YEM  887
247             Zambia   ZMB  894
248           Zimbabwe   ZWE  716

[249 rows x 3 columns]

#### Merge them all

In [60]:
final_df = pd.merge(
    grouped_total_confirmed,
    grouped_total_recovered,
    how="inner",
    on="Country/Region"
)

final_df = pd.merge(
    final_df,
    grouped_total_death,
    how="inner",
    on="Country/Region"
)

final_df = pd.merge(
    final_df,
    df_pop,
    how="inner",
    on="Country/Region"
)

final_df = pd.merge(
    country_code,
    final_df,
    how="inner",
    on="Country/Region"
)

final_df = final_df.sort_values(by="confirmed", ascending=True)
final_df.reset_index(inplace=True, drop=True)
final_df.to_json("new_map.json")

final_df

Empty DataFrame
Columns: [Country/Region, code3, id, confirmed, recovered, deaths, population]
Index: []

calculate cases/million and total death rate

In [61]:
final_df["cases/million"] = ((final_df["confirmed"] / final_df['population']) * 1000000).round(2)
final_df["death rate(%)"] = ((final_df['deaths'] / final_df["confirmed"]) * 100).round(2)
final_df

Empty DataFrame
Columns: [Country/Region, code3, id, confirmed, recovered, deaths, population, cases/million, death rate(%)]
Index: []

In [67]:
country = "Indonesia"
total_all_confirmed = total_confirmed.groupby("Country/Region").sum()
total_all_confirmed.reset_index(inplace=True)

mask = (total_all_confirmed['Country/Region'] == country)

total_all_confirmed = total_all_confirmed.loc[mask]
total_all_confirmed = total_all_confirmed[total_all_confirmed.columns[-1]].sum()

# mask
total_all_confirmed

6738225

function to filter timeseries analysis by country

In [69]:
# use "case" variable just for column name: e.g, case = confirmed, case = deaths
def get_by_country(df: pd.DataFrame, country: str, case: str) -> pd.DataFrame:
    mask = (df["Country/Region"] == country)
    df = df.loc[mask]
    df_country = df.groupby("Country/Region").sum()
    df_country = pd.DataFrame(df[df.columns[4:]].sum())
    df_country.reset_index(inplace=True)
    df_country.columns=["date", f"value_{case}"]
    df_country[f"daily_new_{case}"] = df_country[f"value_{case}"] - df_country[f"value_{case}"].shift()
    df_country = df_country.fillna(0)
    return df_country